cask_args appdir: "/Applications"
tap "caskroom/cask"
tap "caskroom/versions"

# Core dependencies
cask "java"
cask "xquartz"

# Command line apps to install via Homebrew
brew "ack"
brew "asciinema"
brew "awk"
brew "aws-shell"
brew "awscli"
brew "bash-completion"
brew "bash"
brew "bc"
brew "bfg"
brew "boost"
brew "bzip2"
brew "cloc"
brew "curl"
brew "cmake"
brew "diffstat"
brew "diffutils"
brew "ec2-ami-tools"
brew "ec2-api-tools"
brew "ed"
brew "elm"
brew "expect"
brew "ffmpeg"
brew "file-formula"
brew "filebeat"
brew "findutils"
brew "diff-so-fancy"
brew "gnu-tar"
brew "gnupg2"
brew "go"
brew "gpatch"
brew "gpg-agent"
brew "graphicsmagick"
brew "grep"
brew "groff"
brew "gzip"
brew "heroku"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "leiningen"
brew "less"
brew "libxml2"
brew "libxslt"
brew "lsof"
brew "lua"
brew "luajit"
brew "mad"
brew "make"
brew "mas"
brew "maven"
brew "md5sha1sum"
brew "minimesos"
brew "nano"
brew "ncurses"
brew "node"
brew "openssl"
brew "p7zip"
brew "packer"
brew "phantomjs"
brew "pv"
brew "pyenv-virtualenv"
brew "pyenv"
brew "python3"
brew "rbenv"
brew "rsync"
brew "screen"
brew "shellcheck"
brew "sox"
brew "sqlite"
brew "ssh-copy-id"
brew "tcpdump"
brew "tfenv"
brew "thrift"
brew "tmux"
brew "tree"
brew "unrar"
brew "unzip"
brew "wget", args: ["with-gpgme"]
brew "whois"
brew "zlib"
brew "zsh"

# Desktop apps to install via Cask
cask "1password"
cask "atom"
cask "alfred"
cask "betterzip"
cask "busycal"
cask "caffeine"
cask "charles"
cask "chefdk"
cask "consul-cli"
cask "dash"
cask "datagrip"
cask "docker"
cask "dropbox"
cask "eclipse-java"
cask "firefox"
cask "rowanj-gitx"
cask "google-chrome-canary"
cask "google-chrome"
cask "insomnia"
cask "iterm2"
cask "intellij-idea"
cask "istat-menus"
cask "licecap"
cask "osxfuse"
cask "pritunl"
cask "sketch"
cask "skype"
cask "slack"
cask "sourcetree"
cask "spectacle"
cask "switchresx"
cask "sublime-text"
cask "telegram"
cask "transmit"
cask "vagrant"
cask "toggl-beta"
cask "virtualbox"
cask "vmware-fusion"
cask "zoomus"

mas "Microsoft Remote Desktop", id: 715768417
