cask_args appdir: "/Applications"
tap "golangci/tap"
brew "golangci/tap/golangci-lint"

# Loads of things have a hard dependancy on this Java package now...
cask "adoptopenjdk"

brew "ack"
brew "adns"
brew "ansible"
brew "asciinema"
brew "aspell"
brew "autoconf"
brew "awk"
brew "aws-shell"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bash-completion"
brew "bc"
brew "bfg"
brew "boost"
brew "bzip2"
brew "cloc"
brew "cmake"
brew "curl"
brew "diff-so-fancy"
brew "diffstat"
brew "diffutils"
brew "ec2-ami-tools"
brew "ec2-api-tools"
brew "ed"
brew "elm"
brew "exa"
brew "expect"
brew "file-formula"
brew "filebeat"
brew "findutils"
brew "flac"
brew "fontconfig"
brew "freetype"
brew "gd"
brew "gdbm"
brew "gettext"
brew "git"
brew "gmp"
brew "gnu-tar"
brew "gnupg"
brew "gnutls"
brew "go"
brew "gox"
brew "gpatch"
brew "graphicsmagick"
brew "graphviz"
brew "grep"
brew "gzip"
brew "htop"
brew "httpie"
brew "hub"
brew "hugo"
brew "icu4c"
brew "imagemagick"
brew "jasper"
brew "jpeg"
brew "jpegoptim"
brew "jq"
brew "lame"
brew "leiningen"
brew "less"
brew "libassuan"
brew "libevent"
brew "libffi"
brew "libgcrypt"
brew "libgpg-error"
brew "libksba"
brew "libmagic"
brew "libogg"
brew "libpng"
brew "libtasn1"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libusb"
brew "libvorbis"
brew "libxml2"
brew "libxslt"
brew "libyaml"
brew "little-cms2"
brew "lsof"
brew "lua"
brew "luajit"
brew "mackup"
brew "mad"
brew "make"
brew "maven"
brew "md5sha1sum"
brew "minimesos"
brew "mpg123"
brew "mtr"
brew "nano"
brew "ncurses"
brew "nettle"
brew "nmap"
brew "node"
brew "npth"
brew "nspr"
brew "nss"
brew "oniguruma"
brew "openjpeg"
brew "openssl"
brew "optipng"
brew "p11-kit"
brew "p7zip"
brew "packer"
brew "pcre"
brew "pcre2"
brew "pinentry"
brew "pkg-config"
brew "portaudio"
brew "pth"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python"
brew "rbenv"
brew "readline"
brew "rsync"
brew "ruby-build"
brew "screen"
brew "sentinel-simulator"
brew "shellcheck"
brew "sox"
brew "sqlite"
brew "ssh-copy-id"
brew "tcpdump"
brew "telnet"
brew "tfenv"
brew "timedog"
brew "terraform-docs"
brew "thrift"
brew "tmux"
brew "unrar"
brew "unzip"
brew "vault"
brew "webp"
brew "whois"
brew "x264"
brew "xz"
brew "yarn"
brew "zlib"
brew "zsh"

# Desktop apps to install via Cask
cask "1password"
cask "atom"
cask "alfred"
cask "bartender"
cask "betterzip"
cask "busycal"
cask "caffeine"
cask "charles"
cask "cleanshot"
cask "dash"
cask "datagrip"
cask "docker"
cask "dropbox"
cask "eclipse-java"
cask "firefox"
cask "rowanj-gitx"
cask "google-chrome"
cask "iterm2"
cask "intellij-idea"
cask "istat-menus"
cask "keybase"
cask "kitematic"
cask "licecap"
cask "osxfuse"
cask "sketch"
cask "skype"
cask "slack"
cask "sourcetree"
cask "spectacle"
cask "spotify"
cask "steam"
cask "switchresx"
cask "sublime-text"
cask "telegram"
cask "timestamp"
cask "transmit"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vmware-fusion"
cask "zoomus"

mas "Irvue", id: 1039633667
mas "Microsoft Remote Desktop", id: 715768417
mas "Next Meeting", id: 1017470484
mas "Rest", id: 661067914
